notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Om No!</title>

<link rel="stylesheet" href="http://rawgit.com/hakimel/reveal.js/master/css/reveal.min.css"/>
<link rel="stylesheet" href="http://rawgit.com/hakimel/reveal.js/master/css/theme/default.css" id="theme"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>Om No!</h1>
<h2></h2>
<h2><a href="mailto:"></a></h2>
<h2></h2></section>
<section>
<section id="sec-1" >

<h2>Background</h2>
<ul class="org-ul">
<li>5k+ LOC, fairly complex app, almost entirely logic
</li>
<li>100% Om
</li>
<li>we really wanted things to work with Om
</li>
<li>but we hit a wall
</li>
<li>made a switch to Reagent instead
</li>
</ul>
</section>
</section>
<section>
<section id="sec-2" >

<h2>The Good</h2>
</section>
<section id="sec-2-1" >

<h3>Global Undo</h3>
<ul class="org-ul">
<li>this is pretty cool
</li>
<li>Om makes it really easy to do
</li>
<li>could not be used at all for our app
</li>
<li>only useful for side-effect-less applications (graphical editors, etc.)
<ul class="org-ul">
<li>even then you probably want local undo
</li>
</ul>
</li>
</ul>
</section>
<section id="sec-2-2" >

<h3>One Atom</h3>
<ul class="org-ul">
<li>printing out all the state is awesome for debugging
</li>
</ul>
</section>
</section>
<section>
<section id="sec-3" >

<h2>The Bad</h2>
</section>
<section id="sec-3-1" >

<h3>The API</h3>
</section>
<section id="sec-3-1-1" >

<h4>The API is Error-prone</h4>
<ul class="org-ul">
<li>the <code>reify</code>-ed objects are only useful with a <code>build</code> or <code>build-all</code>
</li>
<li>why burden the programmer to remember to do it properly?
</li>
<li>when you have a mix of functions, you now have to have some way to remember which ones return <code>reify</code>-ed objects and which are normal functions
</li>
</ul>
</section>
<section id="sec-3-1-2" >

<h4>The API is Verbose</h4>
<ul class="org-ul">
<li><code>om/IWillMount (will-mount [this] ...)</code>
</li>
<li>what is this, Java?
</li>
</ul>
</section>
<section id="sec-3-1-3" >

<h4>The API is Incomplete</h4>
<ul class="org-ul">
<li>we had to implement <code>IShouldUpdate</code>
</li>
<li>this was an older version, when re-rendering was based on <code>identical?</code> instead of <code>=</code>
</li>
<li>everything was too slow (much slower than AngularJS)
</li>
<li>"You should only implement this if you really know what you're doing. Even then you probably shouldn't."
</li>
<li>a part was left out: "you probably shouldn't because the original uses local variables that aren't part of the API, meaning that you can't slightly tweak the original should-update function and you'll have to break a lot of functionality"
</li>
</ul>
</section>
<section id="sec-3-1-4" >

<h4>The API</h4>
<ul class="org-ul">
<li>we had syntactic sugar for all of these problems
</li>
<li>honestly we could live with it
</li>
<li>all of these add UNNECESSARY complexity
</li>
</ul>
</section>
<section id="sec-3-2" >

<h3>No Anonymous Components</h3>
<ul class="org-ul">
<li>no anonymous functions as components
</li>
<li>no error messages / warnings, it just re-mounts every time
</li>
<li>if you're lucky and your component is slow enough, it will flicker so you can catch it
</li>
</ul>
</section>
<section id="sec-3-3" >

<h3>No First-class Components</h3>
<ul class="org-ul">
<li>we found wrapping components with other components to be a useful pattern
</li>
<li>Om didn't: can't pass them to other components and compose them
</li>
</ul>
</section>
<section id="sec-3-4" >

<h3>Cursors</h3>
</section>
<section id="sec-3-4-1" >

<h4>(= cursors pointers)</h4>
<ul class="org-ul">
<li>Cursors are pointers into the app state
</li>
<li>the data that a cursor points to may have changed, an async <code>transact!</code> will not have changed though
</li>
<li>what is this, C++?
</li>
<li>especially bad in a primarily asynchronous environment
</li>
</ul>
</section>
<section id="sec-3-4-2" >

<h4>Local State Mixed With Global State</h4>
<ul class="org-ul">
<li>this is not necessary AFAIK, but is idiomatic
</li>
<li>local state could be anywhere mixed with the global state
</li>
<li>it feels wrong
</li>
<li>there are real downsides: now we can't overwrite a chunk of the state with new data
</li>
</ul>
</section>
<section id="sec-3-4-3" >

<h4>More Gotchas</h4>
<ul class="org-ul">
<li>cursors behave like maps
</li>
<li>you can pass maps in like cursors
</li>
<li>except when you want to <code>transact!</code>
</li>
<li>two choices:
<ul class="org-ul">
<li>lose benefit of abstraction, use maps when maps should be used
</li>
<li>call every single function like this:
<div class="org-src-container">

<pre  class="src src-clojure">(om/build some-components
          (assoc data-you-dont-need
            :important-key important-value))
</pre>
</div>
<ul class="org-ul">
<li>boilerplate
</li>
<li>encourages giving more data than is necessary
</li>
</ul>
</li>
</ul>
</li>
<li>an argument can be made that you should be explicit about where children components can store their data, but does it have to be so verbose?
</li>
</ul>
</section>
<section id="sec-3-5" >

<h3>"Need to Know" Principle</h3>
<ul class="org-ul">
<li>components work best when they know as little data as possible
</li>
<li>that way, unnecessary re-rendering doesn't have to occur
</li>
<li>Om is a very poor fit for this:
<ul class="org-ul">
<li>app state is in a tree: always need knowledge of the lowest common ancestor
</li>
<li>parents must know everything all children know
</li>
</ul>
</li>
<li>this results in either:
<ul class="org-ul">
<li>the same data in multiple places
</li>
<li>a performance hit
</li>
</ul>
</li>
</ul>
</section>
</section>
<section>
<section id="sec-4" >

<h2>Tough Times</h2>
<ul class="org-ul">
<li>That last problem was a killer
<ul class="org-ul">
<li>it was hard to be consistent
</li>
<li>it was hard to be performant
</li>
</ul>
</li>
<li>we were about to implement a DAG that automatically re-constructs an app state tree by denormalizing ground-truth data when that data changes
</li>
<li>but then we discovered&#x2026;
</li>
</ul>
</section>
</section>
<section>
<section id="sec-5" >

<h2>Reagent Exists</h2>
</section>
<section id="sec-5-1" >

<h3>Why?</h3>
<ul class="org-ul">
<li><code>[X]</code> principle of least suprise (mostly)
</li>
<li><code>[X]</code> all of Clojure-y goodness works
</li>
<li><code>[X]</code> data model works better with React.js
</li>
</ul>
</section>
<section id="sec-5-2" >

<h3>A Story</h3>
<ul class="org-ul">
<li>I made the move from Om -&gt; Reagent over a long weekend
</li>
<li>we had a new guy starting
</li>
<li>co-worker was able to TEACH the new codebase to the new guy perfectly (without ever seeing the code or Reagent before)
</li>
<li>(I cannot think of a better recommendation of a working API)
</li>
</ul>
</section>
<section id="sec-5-3" >

<h3>Our experience</h3>
<ul class="org-ul">
<li>it has been much more pleasurable using Reagent
</li>
<li>I cannot think of a scenario that I would rather use Om than Reagent
<ul class="org-ul">
<li>especially not for code to be maintained by more than just myself
</li>
<li>especially not in a complex app
</li>
<li>especially not when performance is critical
</li>
</ul>
</li>
</ul>
</section>
</section>
<section>
<section id="sec-6" >

<h2>Conclusion</h2>
<ul class="org-ul">
<li>from the outside, Om looks like it takes advantage of all the Clojure-y goodness
</li>
<li>turns out that you lose a lot of that
</li>
<li>Reagent solves every problem with Om we've had, and more, and it's an absolute pleasure to work with
</li>
</ul>
</section>
</section>
</div>
</div>

<script src="http://rawgit.com/hakimel/reveal.js/master/lib/js/head.min.js"></script>
<script src="http://rawgit.com/hakimel/reveal.js/master/js/reveal.min.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: true,
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'http://rawgit.com/hakimel/reveal.js/master/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'http://rawgit.com/hakimel/reveal.js/master/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://rawgit.com/hakimel/reveal.js/master/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://rawgit.com/hakimel/reveal.js/master/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: 'http://rawgit.com/hakimel/reveal.js/master/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'http://rawgit.com/hakimel/reveal.js/master/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
]
});
</script>
</body>
</html>
